{
    "hi": "hello, how are you doing",
    "what is the capital of france?": "The capital of France is Paris.",
    "who is the president of the united states?": "The current president of the United States is Joe Biden.",
    "what is the tallest mountain in the world?": "Mount Everest is the tallest mountain in the world.",
    "who wrote romeo and juliet?": "William Shakespeare wrote Romeo and Juliet.",
    "what is the speed of light?": "The speed of light is approximately 299,792 kilometers per second.",
    "what is the largest ocean on earth?": "The Pacific Ocean is the largest ocean on Earth.",
    "who painted the mona lisa?": "Leonardo da Vinci painted the Mona Lisa.",
    "how many continents are there?": "There are seven continents: Africa, Antarctica, Asia, Europe, North America, Australia, and South America.",
    "what is the longest river in the world?": "The Nile River is the longest river in the world.",
    "what is the chemical symbol for gold?": "The chemical symbol for gold is Au.",
    "how many planets are in the solar system?": "There are eight planets in the solar system.",
    "what is the capital of japan?": "The capital of Japan is Tokyo.",
    "who discovered gravity?": "Sir Isaac Newton discovered gravity.",
    "what is the hardest natural substance on earth?": "Diamond is the hardest natural substance on Earth.",
    "what year did the first moon landing occur?": "The first moon landing occurred in 1969.",
    "who was the first person to walk on the moon?": "Neil Armstrong was the first person to walk on the moon.",
    "what is the capital of germany?": "The capital of Germany is Berlin.",
    "what is the smallest country in the world?": "The smallest country in the world is Vatican City.",
    "what is the chemical formula of water?": "The chemical formula of water is H2O.",
    "who invented the telephone?": "Alexander Graham Bell invented the telephone.",
    "what is the most spoken language in the world?": "The most spoken language in the world is English, followed closely by Mandarin Chinese.",
    "what is the capital of italy?": "The capital of Italy is Rome.",
    "who developed the theory of relativity?": "Albert Einstein developed the theory of relativity.",
    "what is the currency of the united kingdom?": "The currency of the United Kingdom is the British Pound Sterling (GBP).",
    "what is the capital of russia?": "The capital of Russia is Moscow.",
    "what is the main ingredient in bread?": "The main ingredient in bread is flour.",
    "how many bones are in the human body?": "There are 206 bones in the adult human body.",
    "what is the largest desert in the world?": "The largest desert in the world is the Antarctic Desert.",
    "who invented the light bulb?": "Thomas Edison is credited with inventing the light bulb.",
    "what is the largest mammal on earth?": "The largest mammal on Earth is the blue whale.",
    "what is the national flower of japan?": "The national flower of Japan is the cherry blossom (sakura).",
    "how many hearts does an octopus have?": "An octopus has three hearts.",
    "what is the currency of china?": "The currency of China is the Renminbi (Yuan).",
    "who discovered electricity?": "Benjamin Franklin is credited with discovering electricity.",
    "what is the pythagorean theorem?": "The Pythagorean Theorem states that a² + b² = c² in a right-angled triangle.",
    "who painted the starry night?": "Vincent van Gogh painted The Starry Night.",
    "what is the capital of canada?": "The capital of Canada is Ottawa.",
    "how does photosynthesis work?": "Photosynthesis is the process by which green plants use sunlight to synthesize food from carbon dioxide and water.",
    "what is the boiling point of water?": "The boiling point of water is 100°C (212°F) at sea level.",
    "what is the square root of 144?": "The square root of 144 is 12.",
    "who was the first emperor of china?": "Qin Shi Huang was the first emperor of China.",
    "what is the tallest building in the world?": "As of now, the tallest building in the world is the Burj Khalifa in Dubai.",
    "what is the most abundant gas in the earth's atmosphere?": "Nitrogen is the most abundant gas in the Earth's atmosphere, making up about 78%.",
    "what is the human body's largest organ?": "The skin is the largest organ of the human body.",
    "who is considered the father of computers?": "Charles Babbage is considered the father of computers.",
    "what is the chemical formula for table salt?": "The chemical formula for table salt is NaCl (sodium chloride).",
    "what is the capital of brazil?": "The capital of Brazil is Brasília.",
    "what is the speed of sound?": "The speed of sound in dry air at 20°C is about 343 meters per second (1235 km/h or 767 mph).",
    "who invented the world wide web?": "Tim Berners-Lee invented the World Wide Web in 1989.",
    "what is the deepest ocean trench in the world?": "The Mariana Trench is the deepest ocean trench in the world.",
    "who wrote the harry potter series?": "J.K. Rowling wrote the Harry Potter series.",
    "what is the capital of south africa?": "South Africa has three capitals: Pretoria (executive), Bloemfontein (judicial), and Cape Town (legislative).",
    "who was the first woman in space?": "Valentina Tereshkova was the first woman in space.",
    "how long is a marathon?": "A marathon is 42.195 kilometers (26.2 miles) long.",
    "what is the coldest place on earth?": "The coldest place on Earth is Antarctica, specifically the East Antarctic Plateau, where temperatures can drop below -90°C (-130°F).",
    "what causes tides in the ocean?": "Tides are caused by the gravitational pull of the Moon and the Sun on Earth's oceans."

}